#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_function_app.function_public_old: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_public_old: Still reading... [20s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_autoscale_setting.shared_plan_autoscale will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "shared_plan_autoscale" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-public-func-01-autoscale"
        name                = "io-p-itn-auth-public-func-01-autoscale"
        tags                = {}
        # (4 unchanged attributes hidden)

      ~ profile {
            name = "default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_name              = "CpuPercentage" -> "Requests"
                  ~ metric_namespace         = "microsoft.web/serverfarms" -> "microsoft.web/sites"
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-citizen-auth-shared-asp-01" -> (known after apply)
                  ~ threshold                = 45 -> 3000
                    # (6 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_name              = "Requests" -> "CpuPercentage"
                  ~ metric_namespace         = "microsoft.web/sites" -> "microsoft.web/serverfarms"
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-citizen-auth-shared-asp-01"
                  ~ operator                 = "LessThan" -> "GreaterThan"
                  ~ threshold                = 2000 -> 45
                    # (5 unchanged attributes hidden)
                }
              ~ scale_action {
                  ~ cooldown  = "PT20M" -> "PT5M"
                  ~ direction = "Decrease" -> "Increase"
                  ~ value     = 1 -> 2
                    # (1 unchanged attribute hidden)
                }
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-01"
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_name              = "CpuPercentage" -> "Requests"
                  ~ metric_namespace         = "microsoft.web/serverfarms" -> "microsoft.web/sites"
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-citizen-auth-shared-asp-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
                  ~ threshold                = 30 -> 2000
                    # (6 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-citizen-auth-shared-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.function_public.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "CONFIRM_CHOICE_PAGE_URL"                         = "https://api-app.io.pagopa.it/email_confirm.html"
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "2"
          + "NODE_ENV"                                        = "production"
          + "PROFILE_EMAIL_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PROFILE_EMAIL_STORAGE_TABLE_NAME"                = "profileEmails"
          + "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          + "StorageConnection"                               = (sensitive value)
          + "VALIDATION_CALLBACK_URL"                         = "https://api-app.io.pagopa.it/email_verification.html"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-auth-public-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-auth-public-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-citizen-auth-shared-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-citizen-auth-shared-asp-01"
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnauthpublicstfn02"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-auth-public-func-snet-02"
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
            ]
        }
    }

  # module.function_public.azurerm_linux_function_app_slot.this[0] will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "100"
          + "AzureFunctionsWebHost__hostid"                   = "staging"
          + "CONFIRM_CHOICE_PAGE_URL"                         = "https://api-app.io.pagopa.it/email_confirm.html"
          + "COSMOSDB_KEY"                                    = (sensitive value)
          + "COSMOSDB_NAME"                                   = "db"
          + "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "2"
          + "NODE_ENV"                                        = "production"
          + "PROFILE_EMAIL_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PROFILE_EMAIL_STORAGE_TABLE_NAME"                = "profileEmails"
          + "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          + "StorageConnection"                               = (sensitive value)
          + "VALIDATION_CALLBACK_URL"                         = "https://api-app.io.pagopa.it/email_verification.html"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnauthpublicstfn02"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-auth-public-func-snet-02"
      + webdeploy_publish_basic_authentication_enabled = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function_public.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-auth-public-func-02] Health Check Failed"
      + resource_group_name      = "io-p-itn-auth-public-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.function_public.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-auth-public-func-pep-02"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-auth-public-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-auth-public-func-pep-02"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.function_public.azurerm_private_endpoint.staging_function_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-auth-public-staging-func-pep-02"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-auth-public-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-auth-public-staging-func-pep-02"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.function_public.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_role_assignment.staging_function_storage_account_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_public.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass             = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action     = "Deny"
      + id                 = (known after apply)
      + storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthpublicstfn02"
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_api_operation_policy.get_profile_operation_v2 will be created
  + resource "azurerm_api_management_api_operation_policy" "get_profile_operation_v2" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + operation_id        = "getProfile"
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <choose>
                        <when condition="@(!context.User.Groups.Select(g => g.Name).Contains("{{api-profile-operation-group-name}}"))">
                            <return-response>
                                <set-status code="403" reason="Unauthorized, the subscription used doesn't have the required permission" />
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_group.api_profile_operation_read_v2 will be created
  + resource "azurerm_api_management_group" "api_profile_operation_read_v2" {
      + api_management_name = "io-p-apim-v2-api"
      + description         = "A group that enables PagoPa Operation to operate over Profiles"
      + id                  = (known after apply)
      + name                = "apiprofileoperationread"
      + resource_group_name = "io-p-rg-internal"
      + type                = "custom"
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.api_profile_operation_group_name_v2 will be created
  + resource "azurerm_api_management_named_value" "api_profile_operation_group_name_v2" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "api-profile-operation-group-name"
      + id                  = (known after apply)
      + name                = "api-profile-operation-group-name"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.io_fn_profile_key_v2 will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_key_v2" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-fn-profile-key"
      + id                  = (known after apply)
      + name                = "io-fn-profile-key"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.io_fn_profile_url_v2 will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_url_v2" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-fn-profile-url"
      + id                  = (known after apply)
      + name                = "io-fn-profile-url"
      + resource_group_name = "io-p-rg-internal"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = "http"
      + description           = "Product for IO Profile Operation."
      + display_name          = "IO PROFILE OPERATION API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-profile-operation-api"
      + path                  = "profile/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 5.19.0
                  title: IO Profile Function API
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                    Documentation of the IO Profile Function API here.
                servers:
                  - url: https://api.io.pagopa.it/profile/api/v1
                security:
                  - ApiKeyAuth: []
                paths:
                  /profiles/{fiscal_code}:
                    get:
                      operationId: getProfile
                      summary: GetProfile
                      description: Retrieve a user profile
                      tags:
                        - restricted
                      parameters:
                        - $ref: "#/components/parameters/FiscalCode"
                      responses:
                        "200":
                          description: Profile created
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ExtendedProfile"
                        "400":
                          description: Invalid request.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "401":
                          description: Unauthorized
                        "403":
                          description: Forbidden
                        "404":
                          description: No message found.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "429":
                          description: Too many requests
                        "500":
                          description: Server Error
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  parameters:
                    FiscalCode:
                      name: fiscal_code
                      in: path
                      type: string
                      maxLength: 16
                      minLength: 16
                      required: true
                      description: The fiscal code of the user, all upper case.
                      pattern: >-
                        [A-Z]{6}[0-9LMNPQRSTUV]{2}[ABCDEHLMPRST][0-9LMNPQRSTUV]{2}[A-Z][0-9LMNPQRSTUV]{3}[A-Z]
                      x-example: SPNDNL80R13C555X
                  schemas:
                    ExtendedProfile:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        email:
                          $ref: "#/components/schemas/EmailAddress"
                        service_preferences_settings:
                          $ref: "#/components/schemas/ServicePreferencesSettings"
                        blocked_inbox_or_channels:
                          $ref: "#/components/schemas/BlockedInboxOrChannels"
                        preferred_languages:
                          $ref: "#/components/schemas/PreferredLanguages"
                        is_inbox_enabled:
                          $ref: "#/components/schemas/IsInboxEnabled"
                        accepted_tos_version:
                          $ref: "#/components/schemas/AcceptedTosVersion"
                        is_webhook_enabled:
                          $ref: "#/components/schemas/IsWebhookEnabled"
                        is_email_enabled:
                          $ref: "#/components/schemas/IsEmailEnabled"
                        is_email_validated:
                          $ref: "#/components/schemas/IsEmailValidated"
                        is_email_already_taken:
                          type: boolean
                          default: false
                          description: |-
                            True if the user email has been validated by another user.
                            If so, the user must provide a new email.
                        reminder_status:
                          $ref: "#/components/schemas/ReminderStatus"
                        is_test_profile:
                          $ref: "#/components/schemas/IsTestProfile"
                        last_app_version:
                          $ref: "#/components/schemas/AppVersion"
                        push_notifications_content_type:
                          $ref: "#/components/schemas/PushNotificationsContentType"
                        version:
                          type: integer
                      required:
                        - is_email_enabled
                        - is_email_validated
                        - is_email_already_taken
                        - is_inbox_enabled
                        - is_webhook_enabled
                        - service_preferences_settings
                        - version
                    EmailAddress:
                      type: string
                      format: email
                      example: foobar@example.com
                    ServicePreferencesSettings:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        mode:
                          $ref: "#/components/schemas/ServicesPreferencesMode"
                      required:
                        - mode
                    ServicesPreferencesMode:
                      type: string
                      enum:
                        - LEGACY
                        - AUTO
                        - MANUAL
                    BlockedInboxOrChannel:
                      type: string
                      description: |-
                        All notification channels plus the message inbox.
                        These represent all the possible channels a user could block.
                      x-extensible-enum:
                        - EMAIL
                        - INBOX
                        - WEBHOOK
                      example: INBOX
                    BlockedInboxOrChannels:
                      type: object
                      additionalProperties:
                        type: array
                        items:
                          $ref: "#/components/schemas/BlockedInboxOrChannel"
                      description: |-
                        All the notification channels blocked by the user.
                        Each channel is related to a specific service (sender).
                    PreferredLanguages:
                      type: array
                      items:
                        $ref: "#/components/schemas/PreferredLanguage"
                      description: >-
                        Indicates the User's preferred written or spoken languages in order
                
                        of preference. Generally used for selecting a localized User interface.
                        Valid
                
                        values are concatenation of the ISO 639-1 two letter language code, an
                        underscore,
                
                        and the ISO 3166-1 2 letter country code; e.g., 'en_US' specifies the
                        language
                
                        English and country US.
                    PreferredLanguage:
                      type: string
                      x-extensible-enum:
                        - it_IT
                        - en_GB
                        - es_ES
                        - de_DE
                        - fr_FR
                      example: it_IT
                    IsInboxEnabled:
                      type: boolean
                      description: |-
                        True if the recipient of a message wants to store its content for
                        later retrieval.
                    AcceptedTosVersion:
                      type: number
                      minimum: 1
                      description: Version of latest terms of service accepted by the user.
                    IsWebhookEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        the default webhook.
                    IsEmailValidated:
                      type: boolean
                      description: True if the user email has been validated.
                    IsEmailEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        his email address.
                    ReminderStatus:
                      type: string
                      x-extensible-enum:
                        - ENABLED
                        - DISABLED
                      example: ENABLED
                      description: Api definition of reminder opt-in status
                    IsTestProfile:
                      type: boolean
                      description: True if the user's profile is only for test purpose.
                      default: false
                    AppVersion:
                      type: string
                      pattern: ^((0|[1-9]\\d*)\\.){2}(0|[1-9]\\d*)(\\.(0|[1-9]\\d*)){0,1}$
                      description: A string field in Semantic Versioning format
                      example: 1.10.11
                    PushNotificationsContentType:
                      type: string
                      x-extensible-enum:
                        - FULL
                        - ANONYMOUS
                      example: FULL
                      description: >-
                        This parameter specifies how a specific user wants to visualize push
                        notifications.
                
                        FULL leads to descriptive push notifications while ANONYMOUS leads to
                        silent ones.
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence
                
                            of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{io-fn-profile-url}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-fn-profile-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_product_api.this["io-profile-operation-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + product_id          = "io-profile-operation-api"
      + resource_group_name = "io-p-rg-internal"
    }

  # module.io_profile_apim_api_weu.module.apim_v2_product_profile_operation.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + approval_required     = false
      + description           = "Product for IO Profile Operation."
      + display_name          = "IO PROFILE OPERATION API"
      + id                    = (known after apply)
      + product_id            = "io-profile-operation-api"
      + published             = true
      + resource_group_name   = "io-p-rg-internal"
      + subscription_required = false
    }

  # module.io_profile_apim_api_weu.module.apim_v2_product_profile_operation.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + id                  = (known after apply)
      + product_id          = "io-profile-operation-api"
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

Plan: 22 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service_plan.shared_plan_itn,
  on data.tf line 35, in data "azurerm_app_service_plan" "shared_plan_itn":
  35: data "azurerm_app_service_plan" "shared_plan_itn" {

The `azurerm_app_service_plan` data source has been superseded by the
`azurerm_service_plan` data source. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
